cocktail-api/app/controllers/drinks_controller.rb

SELECT "alcoholics"."name" FROM "alcoholics"
SELECT "categories"."name" FROM "categories"
SELECT "glasses"."name" FROM "glasses"
SELECT "ingredients"."name" FROM "ingredients"
---
  def list_options
    options = {
      category: Category.all.pluck(:name),
      glass: Glass.all.pluck(:name),
      ingredient: Ingredient.all.pluck(:name),
      alcoholic: Alcoholic.all.pluck(:name)

SELECT  "drinks".* FROM "drinks" ORDER BY "drinks"."id" DESC LIMIT ?  [["LIMIT", 10]]
---
  def index
    render status: :ok, json: Drink.order(id: :desc).last(10)

INSERT INTO "drinks" ("created_at", "updated_at", "name", "api_id", "thumb_url") VALUES (?, ?, ?, ?, ?)
---
  def create_drink(drink)
    drink_record = %i[name thumb_url api_id].zip(drink.values).to_h
    Drink.create(drink_record)